<?php

use Illuminate\Database\Seeder;

class NoteSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $param = [
            'user_id'   => 1,
            'text'      => "はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。はじめてのノートです。"
        ];
        DB::table('notes')->insert($param);

        $param = [
            'user_id'   => 1,
            'text'      => "2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・2番めのノート・",
        ];
        DB::table('notes')->insert($param);

        $param = [
            'user_id'   => 1,
            'text'      => "3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。3番目のノート。"
        ];
        DB::table('notes')->insert($param);

        $param = [
            'user_id'   => 1,
            'text'      => "4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。4番目のノート。"
        ];

        DB::table('notes')->insert($param);
        $param = [
            'user_id'   => 1,
            'text'      => "5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。5番目のノート。"
        ];
        DB::table('notes')->insert($param);

        $param = [
            'user_id'   => 1,
            'text'      => "6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・6番目のノート・"
        ];
        DB::table('notes')->insert($param);

        $param = [
            'user_id'   => 1,
            'text'      => "7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・7番目のノート・"
        ];
        DB::table('notes')->insert($param);

        $param = [
            'user_id'   => 1,
            'text'      => "8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。8番目のノート。"
        ];
        DB::table('notes')->insert($param);

        $param = [
            'user_id'   => 1,
            'text'      => "9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。9番目のノート。"
        ];
        DB::table('notes')->insert($param);

    }
}
